answer_examples = [
        {
  "input": "기계 학습 모델을 이용한 생물학적 이미지 변환 기술로 특허를 낼 수 있을까?",
  "answer": """네, 기계 학습 모델을 이용한 생물학적 이미지 변환 기술은 특허로 출원 가능할 수 있습니다. 하지만 등록은 되었지만, 특허 확정은 되지 않았으므로 주의 바랍니다.
예를 들어, 이 특허는 생물학적 샘플들의 이미지를 생성하기 위해 기계 학습 모델을 훈련하는 방법에 대해 설명하고 있습니다. 
주요 절차로는 훈련 이미지들을 통해 웨이블릿 계수를 생성하고, 이를 바탕으로 합성 이미지를 생성한 후 실제 이미지와 비교해 기계 학습 모델을 개선하는 방식이 포함되어 있습니다. 
"""
},
{
  "input": "기계 학습 모델을 이용한 생물학적 이미지 변환 기술로 특허를 낼 수 있을까?",
  "answer": """네, 기계 학습 모델을 이용한 생물학적 이미지 변환 기술은 특허로 출원 가능할 수 있습니다. 하지만 등록은 되었지만, 특허 확정은 되지 않았으므로 주의 바랍니다.
예를 들어, 이 특허는 생물학적 샘플들의 이미지를 생성하기 위해 기계 학습 모델을 훈련하는 방법에 대해 설명하고 있습니다. 
주요 절차로는 훈련 이미지들을 통해 웨이블릿 계수를 생성하고, 이를 바탕으로 합성 이미지를 생성한 후 실제 이미지와 비교해 기계 학습 모델을 개선하는 방식이 포함되어 있습니다. 
"""
}

]