answer_examples = [
{
      "input": "시나리오 시뮬레이션과 관련된 특허 있어?",
      "answer": """
네, 관련된 특허가 있습니다. 다음은 주요 특허 3가지입니다.

1. 시나리오를 이용한 시뮬레이션 방법 및 시스템
기구 객체의 이동과 관련된 시나리오를 시뮬레이션에서 활용하며, 동작 성공 여부에 따라 씬 데이터를 생성해 클라이언트로 전송

2. 주행 시나리오 시뮬레이션 생성 방법 및 장치
차량 주행 정보를 기반으로 프롬프트를 생성해 언어 모델로 주행 시나리오를 생성하고, 시뮬레이터로 검증하며 언어 모델을 재학습

3. VR 시나리오에서의 롤 플레이 시뮬레이션 방법 및 단말 기기
VR 시나리오에서 손 모델과 상호작용을 통해 가상 역할을 수행하고, 음악 파일 재생에 따라 가상 아이템을 동적으로 조정
"""
    },
{
      "input": "시나리오 시뮬레이션의 유사 특허들을 보여줘",
      "answer": """
네, 다음은 주요 유사 특허 3가지입니다.

1. 시나리오를 이용한 시뮬레이션 방법 및 시스템

2. 주행 시나리오 시뮬레이션 생성 방법 및 장치

3. VR 시나리오에서의 롤 플레이 시뮬레이션 방법 및 단말 기기

"""
    },
{
  "input": "우울증 진단 게임 특허가 있어?",
  "answer": """
우울증 진단 게임과 직접적으로 동일한 특허는 없지만, 유사한 기능이나 목적을 가진 특허는 존재합니다. 다음은 주요 유사 특허 3가지입니다:

1. 게임 분석 요소를 활용한 중증 정신 장애 진단 장치 및 방법
임화된 심리 검사를 통해 우울증, 조울증, 조현병 등을 간편하고 저비용으로 감별 진단할 수 있는 방법

2. 인지 게임을 자동 추천하는 인지 상태 진단 장치
사용자 데이터를 기반으로 맞춤형 인지 모델을 생성하고, 자동으로 태스크를 수행하며 인지 상태를 평가

3. 인지 진단 게임을 이용한 인지 진단 평가를 위한 컴퓨터 프로그램 기록매체
인지 게임을 통해 사용자 반응 데이터를 분석하고, 학습 기반 맞춤형 인지 모델로 인지 상태를 진단 및 평가

"""
},
{
  "input": "우울증 진단 게임의 유사 특허들을 보여줘",
  "answer": """
네, 다음은 주요 유사 특허 3가지입니다.:

1. 게임 분석 요소를 활용한 중증 정신 장애 진단 장치 및 방법

2. 인지 게임을 자동 추천하는 인지 상태 진단 장치

3. 인지 진단 게임을 이용한 인지 진단 평가를 위한 컴퓨터 프로그램 기록매체

"""
},

]